In [44]:
import numpy as np
import pandas as pd

In [45]:
date_df = pd.read_csv('orders.csv')
time_df = pd.read_csv('messages.csv')

In [46]:
date_df.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [47]:
time_df.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [ ]:
date_df.info()   # Default => Date is considered as object(string) type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [ ]:
time_df.info()  # Default => Time is considered as object(string) type

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

### Working with Dates :

In [50]:
# Converting to datetime datatype
date_df['date'] = pd.to_datetime(date_df['date'])

In [51]:
date_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [52]:
# Extract Year , Month
date_df['date_year'] = date_df['date'].dt.year
date_df['date_month_no'] = date_df['date'].dt.month

date_df.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [53]:
# Extract Month_Name , Day
date_df['date_month_name'] = date_df['date'].dt.month_name()
date_df['date_day'] = date_df['date'].dt.day

date_df.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [54]:
# Extract day of week
date_df['date_dow'] = date_df['date'].dt.dayofweek
date_df.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [55]:
# Extract Day of week - name

date_df['date_dow_name'] = date_df['date'].dt.day_name()

date_df.drop(columns=['product_id','city_id','orders'],inplace=True)

date_df.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [57]:
# Check if is weekend?

date_df['date_is_weekend'] = np.where(date_df['date_dow_name'].isin(['Sunday', 'Saturday']), 1,0)
date_df.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

In [ ]:
# Extract week number of the Year
date_df['date_week'] = date_df['date'].dt.isocalendar().week
date_df.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43
3,2019-08-17,2019,8,August,17,5,Saturday,1,33
4,2019-01-06,2019,1,January,6,6,Sunday,1,1

In [62]:
# Extract quarter of the year
date_df['quarter'] = date_df['date'].dt.quarter
date_df.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1

In [63]:
# Extract semester of the year
date_df['semester'] = np.where(date_df['quarter'].isin([1,2]), 1, 2)
date_df.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,50,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,33,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,43,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,33,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,1,1,1

In [64]:
import datetime

today = datetime.datetime.today()

today

datetime.datetime(2025, 8, 18, 18, 58, 37, 219460)

In [ ]:
# Extract TIME elapsed between dates
today - date_df['date']

0     2078 days 18:58:37.219460
1     2560 days 18:58:37.219460
2     2491 days 18:58:37.219460
3     2193 days 18:58:37.219460
4     2416 days 18:58:37.219460
                 ...
995   2506 days 18:58:37.219460
996   2447 days 18:58:37.219460
997   2295 days 18:58:37.219460
998   2360 days 18:58:37.219460
999   2134 days 18:58:37.219460
Name: date, Length: 1000, dtype: timedelta64[ns]

In [ ]:
# Extract DAYS elapsed between dates
(today - date_df['date']).dt.days

0      2078
1      2560
2      2491
3      2193
4      2416
       ...
995    2506
996    2447
997    2295
998    2360
999    2134
Name: date, Length: 1000, dtype: int64

In [ ]:
# Extract MONTHS elapsed between dates
((today - date_df['date']).dt.days / 30).round()

0      69.0
1      85.0
2      83.0
3      73.0
4      81.0
       ...
995    84.0
996    82.0
997    76.0
998    79.0
999    71.0
Name: date, Length: 1000, dtype: float64

### Working with TIME :

In [ ]:
# Converting to 'datetime' datatype
time_df['date'] = pd.to_datetime(time_df['date'])

In [73]:
time_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [74]:
# Extract hour, minute, second from time
time_df['hour'] = time_df['date'].dt.hour
time_df['min'] = time_df['date'].dt.minute
time_df['sec'] = time_df['date'].dt.second

time_df.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [77]:
# Extract Time separately
time_df['time'] = time_df['date'].dt.time

time_df.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [79]:
# Extract TIME elapsed between dates
today - time_df['date']

0     4264 days 18:08:37.219460
1     4128 days 19:18:37.219460
2     4614 days 18:37:37.219460
3     3916 days 18:27:37.219460
4     4313 days 19:47:37.219460
                 ...
995   4903 days 18:08:37.219460
996   4224 days 19:44:37.219460
997   4689 days 19:21:37.219460
998   4805 days 19:24:37.219460
999   4077 days 19:33:37.219460
Name: date, Length: 1000, dtype: timedelta64[ns]

In [81]:
# Extract SECONDS elapsed between dates
(today - time_df['date'])/np.timedelta64(1,'s')

0      3.684749e+08
1      3.567287e+08
2      3.987167e+08
3      3.384089e+08
4      3.727145e+08
           ...
995    4.236845e+08
996    3.650247e+08
997    4.051993e+08
998    4.152219e+08
999    3.523232e+08
Name: date, Length: 1000, dtype: float64

In [ ]:
# Extract MINUTES elapsed between dates
(today - time_df['date'])/np.timedelta64(1,'m')

0      6.141249e+06
1      5.945479e+06
2      6.645278e+06
3      5.640148e+06
4      6.211908e+06
           ...
995    7.061409e+06
996    6.083745e+06
997    6.753322e+06
998    6.920365e+06
999    5.872054e+06
Name: date, Length: 1000, dtype: float64

In [ ]:
# Extract HOURS elapsed between dates
(today - time_df['date'])/np.timedelta64(1,'h')

0      102354.143672
1       99091.310339
2      110754.627005
3       94002.460339
4      103531.793672
           ...
995    117690.143672
996    101395.743672
997    112555.360339
998    115339.410339
999     97867.560339
Name: date, Length: 1000, dtype: float64